cases/circular_Re100/fine/system/sampleMeanFODict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  2312                                  |
|   \  /    A nd           | Website:  www.openfoam.com                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       dictionary;
    location    "system";
    object      sampleMeanFODict;
}

functions
{
    sampleMean
    {
        type                sets;
        libs                (sampling);
        writeControl        writeTime;
        interpolationScheme cellPoint;
        setFormat           csv;

        fields              (UMean pMean);

        sets
        (
            wake_x1D
            {
                type    uniform;
                axis    y;
                start   (1.0 -3.0 0.0);
                end     (1.0  3.0 0.0);
                nPoints 121;
            }
            wake_x2D
            {
                type    uniform;
                axis    y;
                start   (2.0 -3.0 0.0);
                end     (2.0  3.0 0.0);
                nPoints 121;
            }
            wake_x5D
            {
                type    uniform;
                axis    y;
                start   (5.0 -3.0 0.0);
                end     (5.0  3.0 0.0);
                nPoints 121;
            }
            wake_x10D
            {
                type    uniform;
                axis    y;
                start   (10.0 -3.0 0.0);
                end     (10.0  3.0 0.0);
                nPoints 121;
            }
            wake_x15D
            {
                type    uniform;
                axis    y;
                start   (15.0 -3.0 0.0);
                end     (15.0  3.0 0.0);
                nPoints 121;
            }
            centerline
            {
                type    uniform;
                axis    x;
                start   (0.5 0.0 0.0);
                end     (20.0 0.0 0.0);
                nPoints 196;
            }
        );
    }
}
